# ____________________________________________________________
"""Заменить в списке отрицаттельные элементы  на 0"""

a = [1,3,4,5,2,-8,7,-2,0,5]

print([0 if x < 0 else x for x in a])
# [1, 3, 4, 5, 2, 0, 7, 0, 0, 5]
# ____________________________________________________________
"""Сравниваем элементы разных списков одной длины"""
q , r = [1,3,5], [2,3,4]

print([True if x == y else False for x in q for y in r ])
#[False, False, False, False, True, False, False, False, False]
"""Создать строку из одинаковых букв  двух строк"""

s1 = "ovhvjvpteqpdpmuf"
s2 = "fequjdpvmjth"

print(''.join([x for x in s1 if x in s2]))
# vhvjvpteqpdpmuf
# _______________________________________________________________

